In [1]:
# # Generate Data
# import numpy as np
# np.random.randn()
# np.random.randint()
# np.random.choice()
# np.unique(return_unique=True)

In [4]:
from scipy import stats
# stats.describe()
# stats.itemfreq()
salaries_dist=stats.norm(500, 50)

In [ ]:
# Create Distributions

In [6]:
salaries=salaries_dist.rvs(15000000)

In [11]:
salaries_dist.pdf(600)

0.0010798193302637613

In [12]:
salaries_dist.cdf(400)

0.022750131948179195

In [14]:
salaries_dist.cdf(500) - salaries_dist.cdf(300)

0.4999683287581669

In [18]:
mybinom=stats.binom(6,.5)

In [19]:
mybinom.rvs(10000)

array([3, 1, 3, ..., 5, 4, 3])

In [21]:
mybinom.pmf(6)

0.015625000000000007

In [27]:
m=stats.binom(1000, .6)  # dist of sample

In [35]:
voting_dist=stats.binom(15000, .6)

In [36]:
# voting_dist.rvs(1000000)

In [37]:
m.pmf(1000000)

0.0

In [42]:
voting_dist.pmf(10000)

1.4817907518036142e-64

In [72]:
print('%.900f'%sum([voting_dist.pmf(v) for v in np.arange(10000, dtype=float)]))

0.999999999979702014485383188002742826938629150390625000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000

In [66]:
m=stats.binom(1000,0.7)
m.pmf(500)

3.4791609391653284e-40

In [70]:
np.sum([float(m.pmf(v)) for v in range(1,500)])

2.586932737589789e-40

# Pandas

In [73]:
import pandas as pd

## Series

In [74]:
pd.Series([10,20,40,50])

0    10
1    20
2    40
3    50
dtype: int64

In [84]:
s=pd.Series(['hasan','ziad','alma'], index=['112', 'two','istanbul'])
s

112         hasan
two          ziad
istanbul     alma
dtype: object

In [86]:
s['112']

'hasan'

In [83]:
s['two']

'ziad'

In [87]:
s[0]

'hasan'

In [92]:
s.values

array(['hasan', 'ziad', 'alma'], dtype=object)

In [90]:
s.index

Index(['112', 'two', 'istanbul'], dtype='object')

In [93]:
s

112         hasan
two          ziad
istanbul     alma
dtype: object

In [94]:
s['ten']='sedra'

In [95]:
s

112         hasan
two          ziad
istanbul     alma
ten         sedra
dtype: object

## DataFrame

In [114]:
pd.DataFrame({'name':['hasan','ali','sedra','alma'],
             'salary':[500,600,400,300]}, index=[112, 113, 200, 202])

      name  salary
112  hasan     500
113    ali     600
200  sedra     400
202   alma     300

In [115]:
df=pd.DataFrame([['hasan',500],
             ['ali',600],
             ['sedra',400],
             ['alma',300]], columns=['name','salary'], index=['one','two','ten','hundred'])
df

          name  salary
one      hasan     500
two        ali     600
ten      sedra     400
hundred   alma     300

In [113]:
df.salary

0    500
1    600
2    400
3    300
Name: salary, dtype: int64

**Exercise01** 

Create a Pandas DataFrame, named 'SYR', whose columns are 'governorate', 'pop' and 'area'. The rows represent the following:

- Aleppo is 18,500  square km.  In the 2018 census, Aleppo had 4.6 million people.
- Latakia , with 2018 population 1.27 million, has an area of 2,297 square km.
- Damascus is 1,599 square km.  The 2018 population was 2.2 million.
- In 2018, Homs  had 1.7 million inhabitants.  It is 42,223 square km.
- 1.6 million people lived across the 8,883 square km of Hama , in 2018.

Create a new column representing the population density using:
```
SYR['density']=SYR['pop']/SYR['area']
```

Now set the index of SYR to be the governorate names using `set_index` function of a data frame. Make sure to update the data frame.

In [127]:
syr= pd.DataFrame({'governorate':['Aleppo','Latakia','Damascus','Homs','Hama'],
             'area':[18500,2297, 1599, 42223,8883],
             'population':[4.6,1.27,2.2,1.7,1.6]})
syr

  governorate   area  population
0      Aleppo  18500        4.60
1     Latakia   2297        1.27
2    Damascus   1599        2.20
3        Homs  42223        1.70
4        Hama   8883        1.60

In [122]:
syr.values

array([['Aleppo', 18500, 4.6],
       ['Latakia', 2297, 1.27],
       ['Damascus', 1599, 2.2],
       ['Homs', 42223, 1.7],
       ['Hama', 8883, 1.6]], dtype=object)

In [123]:
syr.index

RangeIndex(start=0, stop=5, step=1)

In [124]:
syr.columns

Index(['governorate', 'area', 'pop'], dtype='object')

In [125]:
syr.area

0    18500
1     2297
2     1599
3    42223
4     8883
Name: area, dtype: int64

In [130]:
syr.population

0    4.60
1    1.27
2    2.20
3    1.70
4    1.60
Name: population, dtype: float64

In [135]:
syr=syr.set_index('governorate')

In [136]:
syr

              area  population
governorate
Aleppo       18500        4.60
Latakia       2297        1.27
Damascus      1599        2.20
Homs         42223        1.70
Hama          8883        1.60

In [138]:
syr.area['Aleppo']

18500

In [139]:
syr

              area  population
governorate
Aleppo       18500        4.60
Latakia       2297        1.27
Damascus      1599        2.20
Homs         42223        1.70
Hama          8883        1.60

In [141]:
s=pd.Series(['hasan','ali','sedra','alma'],index=['dr','dr','st','st'])

In [144]:
s['st']

st    sedra
st     alma
dtype: object

In [145]:
syr

              area  population
governorate
Aleppo       18500        4.60
Latakia       2297        1.27
Damascus      1599        2.20
Homs         42223        1.70
Hama          8883        1.60

In [148]:
syr=syr.reset_index()

In [149]:
syr

  governorate   area  population
0      Aleppo  18500        4.60
1     Latakia   2297        1.27
2    Damascus   1599        2.20
3        Homs  42223        1.70
4        Hama   8883        1.60

In [150]:
syr.columns=['City','Area','Population']

In [152]:
syr.columns=syr.columns.str.replace('Population','popu')

In [153]:
syr

       City   Area  popu
0    Aleppo  18500  4.60
1   Latakia   2297  1.27
2  Damascus   1599  2.20
3      Homs  42223  1.70
4      Hama   8883  1.60

In [159]:
!ls

Applications    Downloads       Music           Session09.ipynb nltk_data
Desktop         Library         Pictures        eclipse         seaborn-data
Documents       Movies          Public          hw5.circ

In [160]:
pd.read_csv('Desktop/NYC.csv')

            boro   pop  area   density
0          Bronx  1.39    42  0.033095
1      Manhattan  1.59    23  0.069130
2       Brooklyn  2.47    71  0.034789
3  Staten Island  0.44    59  0.007458
4         Queens  2.23   109  0.020459

In [165]:
pd.read_csv('Desktop/mydata.txt',sep='\t')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [166]:
pd.read_csv('Desktop/mydata.txt',sep='\t', header=None)

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [167]:
pd.read_csv('Desktop/mydata.txt',sep='\t', names=['col1','col2','col3','col4','message'])

  col1 col2 col3 col4  message
0    a    b    c    d  message
1    1    2    3    4    hello
2    5    6    7    8    world
3    9   10   11   12      foo

In [168]:
syr

       City   Area  popu
0    Aleppo  18500  4.60
1   Latakia   2297  1.27
2  Damascus   1599  2.20
3      Homs  42223  1.70
4      Hama   8883  1.60

In [171]:
syr['density']=syr['Area']/syr['popu']

In [172]:
syr

       City   Area  popu       density
0    Aleppo  18500  4.60   4021.739130
1   Latakia   2297  1.27   1808.661417
2  Damascus   1599  2.20    726.818182
3      Homs  42223  1.70  24837.058824
4      Hama   8883  1.60   5551.875000

In [174]:
syr.to_csv('syr.csv')

In [175]:
!ls

Applications          Music                 hw5.circ
Desktop               Pictures              nltk_data
Documents             Public                seaborn-data
Downloads             Session09-Copy1.ipynb syr.csv
Library               Session09.ipynb
Movies                eclipse

### Combine Data Frames

In [ ]:
# using concat

In [215]:
df1=pd.DataFrame(np.arange(9).reshape((3,3)), columns=['a','b','c'])
df2=pd.DataFrame(np.arange(8).reshape((4,2)), columns=['d','e'])

In [216]:
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [217]:
df2

   d  e
0  0  1
1  2  3
2  4  5
3  6  7

In [227]:
pd.concat([df1,df2], axis=0)

     a  b    c    d
0  0.0  1  2.0  NaN
1  3.0  4  5.0  NaN
2  6.0  7  8.0  NaN
0  NaN  1  NaN  0.0
1  NaN  3  NaN  2.0
2  NaN  5  NaN  4.0
3  NaN  7  NaN  6.0

In [220]:
res=pd.concat([df1,df2], axis=1, join='inner')

In [202]:
pd.concat([df1,df2], axis=1)

     a    b    c  d  e
0  0.0  1.0  2.0  0  1
1  3.0  4.0  5.0  2  3
2  6.0  7.0  8.0  4  5
3  NaN  NaN  NaN  6  7

In [224]:
# using merge
df1=pd.DataFrame(np.arange(9).reshape((3,3)), columns=['a','b','c'])
df2=pd.DataFrame(np.arange(8).reshape((4,2)), columns=['d','b'])

In [225]:
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [226]:
df2

   d  b
0  0  1
1  2  3
2  4  5
3  6  7

In [230]:
pd.merge(df1, df2, on='b', how='inner')

   a  b  c  d
0  0  1  2  0
1  6  7  8  6